[
    {
        "id": "cu_yeokin",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Yeokin",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The vast majority of people in Arden Eld live in the Green, the swathes of peaceful farmland, villages, townships, and trading posts in between the arkenruins. Life in the villages is hard work but generally pleasant, and organized around the yearly harvests. Neighboring villages tend to depend on each other for trade, safety, and information, and come together for festivals (of which there are many, especially in the summer months). The villages typically are run by a city elder, or a council of elders and have a strong connection to nature and its cycles. Faithful villagers tend to pay their respects to the local nature spirits or the Titans at shrines or holy sites such as pools or groves."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Villagers tend to be proud of their local traditions, festivals, and gods. Most villages have a regional cooking or craft specialty, and people will often visit from many towns over just to sample them. One village might specialize in iron and smithing work, another might be known for the quality of its steamed buns and its pork, and another might have miles of beautiful grazing pastures and be known for the quality of its milk and dairy products."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Regional village councils sometimes will gather a militia to defend against a surfacing ruin or a blight, and those towns very close to the ruins typically have a wall to keep out roaming monsters. Many villages, especially those deep in the wilderness, will train some or most of their members in old martial arts techniques unique to each village that can be used to defend the village in times of crisis, recording these techniques on scrolls that are closely kept secrets."
            }
        ],
        "values": [
            {
                "tags": {"desc_type" : "effect"},
                "content": "Community, hard work, respect for nature, and family",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are strong values for Yeokin. Outsiders can sometimes see them as parochial, stubborn, and uneducated."
                    }
                ]
            }
        ]
    },
    {
        "id": "cu_islander",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Islander",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The islands around Arden Eld are an oddity, in that most of the arkenruins out there are sunken beneath the ocean. Unfortunately, this has only made them more active. The island chains are beautiful, sun-soaked places that seem paradise like to many Kin, but the people that live there are tough and disciplined, having to constantly defend their idyllic-seeming homes from horrors that rise unendingly from the sea. The weather in between the islands can range from merely stormy to apocalyptic, making travel incredibly difficult."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Islanders are prolific sailors, strong drinkers, and prodigious fighters. They tend to have a dark sense of humor and more than a touch of bravado. Most of their living is made through fishing, carpentry, mercenary work, and through trade and commerce with the mainland. Islanders have strong taboos about going back on promises, and value someone’s word very strongly."
            }
        ],
        "values": [
            {
                "tags": {"desc_type" : "effect"},
                "content": "Respect for strength, a healthy sense of humor, reliability, and independence",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are all strong values for Islanders. Outsiders can sometimes see them as foolhardy, rude, or loud."
                    }
                ]
            }
        ]
    },
    {
        "id": "cu_leggio",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Leggio",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The villages of the Green rely on a healthy network of trade caravans, peddlers, crafts-kin, menders, and healers of all kinds. Parts of these networks are made up of local farmers and traders, but over time some of the caravans have grown into permanent residences and a quasireligious way of life for the people that crew them, who have come to be known as the Leggio. Their massive, colorful caravans make seasonal rotations around Arden Eld, stopping in the cities to resupply, and are broadly welcome wherever they show up, since it means a chance to buy, repair, and indulge in all the necessities and  luxuries so sorely missed. The Leggio always eat well and trade fairly with the towns, and will often take on travelers who are seeking safe passage to the next village, post, or city."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Nearly all Leggio have some sort of family trade or skill they are specialized in (sometimes multiple), and many famous or legendary artisans, smiths, and weapon makers come from old Leggio families. Leggio Grand Caravans can be two (or sometimes three!) stories high and are carved with family histories. They are pulled by draft beasts and sometimes captive monsters, who are kept docile by Leggio beast tamers."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Leggio are nearly all armed and trained in fighting since they were young as they often have to pass through dangerous or blighted areas in order to reach a town in need. They regard their duty to keep towns supplied as sacred and pray to the Titan of chance to give them safe passage."
            }
        ],
        "values": [
            {
                "tags": {"desc_type" : "effect"},
                "content": "Craft, sociability, discipline, and hospitality",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are all strong values for Leggio. Outsiders can sometimes see them as insular, overly friendly, or nosy."
                    }
                ]
            }
        ]
    },
    {
        "id": "cu_churner",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Churner",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "A sporadic, nomadic culture, churners live a dangerous and daring existence, especially compared to most people of Arden Eld. In their caravans and camps, they follow around Arkenruins as they surface, and make their living off them in whatever way they can. Sometimes this involves venturing into the ruins themselves (though never too far for most Churners, they leave that up to the adventurers and the foolhardy), and scraping Dust from the ruins, or searching the surface levels for fragments of Arkentech. Most of the time this involves directly servicing the adventurers themselves who venture into the ruins by supplying them with necessary food, supplies, arms and armor, and elixirs. When a new ruin is discovered or surfaces from deep beneath the earth, it is not uncommon for a Churner camp to appear at the edge shortly after, like a spray of brightly blossoming flowers over a grave."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Especially brave Churners will sometimes set up shop within the surface levels of a dungeon, sometimes maintaining large crops of herbs, fungi, or other staples that will only grow in the dust-soaked environment of the arkenruins. The more daring of them will hire themselves out as guides, tinkers, or hirelings for wealthier adventurers. Due to their unique living circumstances, most Churners tend to know more about monsters than any other culture, mostly their spoor, habits, and how to avoid them."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Churners are a highly itinerant culture, and while some travel together, they tend to congregate only when a new dungeon surfaces and the old sites dry up. Many of them are former adventurers who have settled out of obligation or necessity and seek a slightly more respectable existence, but others are skilled merchants, crafts-kin, cooks, smiths, and suppliers that come from old families of Churners and run their tents and wagons with a high respect of the Churner Code (honesty, safety, convenience). Recently, due to the increasing ruin activity, the number of Churners has been rapidly increasing, and a lot of the old and more respectable families complain of grifters, swindlers, and ill-intentioned shady merchants sullying their reputation."
            }
        ],
        "values": [
            {
                "tags": {"desc_type" : "effect"},
                "content": "Dependability, hustle, professionalism, and caution",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are highly valued by Churners. Outsiders can sometimes see them as deceptive, opportunistic, or exploitative."
                    }
                ]
            }
        ]
    },
    {
        "id": "cu_chronicler",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Chronicler",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The ancient monasteries of the Chroniclers dot Arden Eld, overlooking its deep valleys from mountain perches, or buried deep in the rifts of its canyons. Within is buried ancient knowledge - and sometimes dangerous secrets."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Chroniclers are a unique, isolated culture - a quasi-religious society of monks and acolytes built around the Chambers - the great monasteries of the continent, whose building predates the Arken and survived their fall. There are twelve of these ancient edifices, and they are typically located in extreme or hard to reach locales, requiring them to be self sufficient. Small monastery towns and trading posts grew up around them over time, forming a tight-knit communities that revolved around and intermeshed with monastery life - moving with their festivals, rituals, and traditions."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "The Chambers are part temple, part archive, and part prison. As legend goes, they were built to protect the great secrets of the making of the world. Some of their inner vaults now lie empty, and three of the Chambers are broken and hollow ruins, whatever was contained within long disgorged into the world. The inner passages and halls of the Chambers are rumored to be full of all kinds of secret knowledge, ancient weaponry, and old and powerful evils - though none can say for sure."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "As for the Chroniclers themselves, they live in a strict, hierarchical, and somewhat spartan society, but one which values justice, education, equality, and honesty. Ascending up the ranks of the priesthood takes a long time and a lot of ceremony, and only the most senior monks are allowed into the central halls of a Chamber."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "It is not uncommon at all for monks to dip and out of the priesthood in order to have families, explore the world, or go on missions of utmost import for the monastery. Junior temple acolytes wishing to become higher members of a Chronicler order are often required to leave the temple for a while to find purpose in the greater world."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Chroniclers highly value knowledge of all kinds, and tend to be highly educated. This drive often pushes traveling chroniclers to explore ruins, challenge authorities, or pry where they don’t belong, often getting them into danger."
            }
        ],
        "values": [            
            {
                "tags": {"desc_type" : "effect"},
                "content": "Truth, justice, discovery, and tradition",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are important values to Chroniclers. Outsiders can see them as secretive, old-fashioned, or stiff."
                    }
                ]
            }
        ]
    },
    {
        "id": "cu_guilder",
        "type": "Culture",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Guilder",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "There are no nations in Arden Eld, but its cities are growing in both size and influence. Their cobbled streets and teetering towers are expanding and stretching to the sky, and the fires of industry and arkentech burn deep in their bellies."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Those that live in the cities are known as Guilders, and often belong to one of the great Trade Guilds, loose and oligarchical organizations that regulate the trade and production of certain items between cities and act as informal government associations of sorts. Cities are often ruled by the guilds or their proxies and to most people of Arden Eld are chaotic, overcrowded, wondrous, and very smelly places where the food is greasy, the markets are bright and burgeoning, and the sights are as incredible as they are strange."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Cities are the centers of technology and magic in Arden Eld and are the chief drivers of the hunger for Dust and arkentech, which the technomagical institutes and Guilds use to produce mechanical and magical wonders. Citizens of the great cities of Arden Eld are the most diverse in background and profession, and tend to enjoy a higher standard of living than those in the Green, with access to many conveniences such as rail and airship travel, running water, and arkenlamp lighting. However, they also are the most unequal, with many Kin languishing crammed into hot and overcrowded residences in the increasingly mazelike city depths, while the Guild Barons at the top scrape most of the benefits off for themselves while claiming to be acting for the benefit of all. Some predict the coming of the Churning Age will extend this way of life even out to the Green, and fear what that portends."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Guilders tend to be more educated, more knowledgeable about Aetheric principles and more connected to magic and science than other Kin, who they may see as backwards. They also tend to be very tolerant and welcoming, and the most worldly of Kin."
            }
        ],
        "values": [
            {
                "tags": {"desc_type" : "effect"},
                "content": "Tolerance, patience, drive, and friendliness",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "are highly valued by Guilders. Outsiders can sometimes see them as haughty, know-it-all, or pampered."
                    }
                ]
            }
        ]
    }
]