[
    {
        "id": "kn_thrynn",
        "type": "Kin",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Thrynn",
        "image": "https://i.imgur.com/y4z2yJ8.png",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The Aethrynn, or Thrynn (most commonly) are found everywhere across Arden Eld. They are an adaptable, diverse people with a strong sensitivity to Aether and a strong connection to arkentech, some say because they are direct descendants of the Arken that survived or fled the Doom and the dark age that followed. They make up a large part of airship crews and captains in the great Guilds due to their potential for aether sensitivity making them excellent pilots."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Thrynn are made up of a dazzling swathe of backgrounds that span the continent. They tend to live in clans that cluster into villages, towns, and city associations. Symbology and culture of the ancient Thrynn clans, called the Seven Families, are present in many modern cultures of Arden Eld, and some draw strength and purpose from their ancient texts and teachings."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Some Thrynn will occasionally have small glowing ‘star-marks’ on their body, especially when attuned to or channeling strong sources of Aether. These can form constellations of stars or twisting branch-like patterns under their skin. Occasionally these marks are strong enough that even being near to a strong source of Aether is enough to light them up."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Very rarely, Thrynn are born with delicate vestigial insect-like wings, not capable of flight. Children born this way are given special attention, having been divinely marked, and often have roles in the community leadership or priesthood prepared for them. They may grow into these roles or eventually reject them."
            }
        ]
    },
    {
        "id": "kn_trogg",
        "type": "Kin",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Trogg",
        "image": "https://i.imgur.com/mwDXgbd.png",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "Troggs, also called Ogres, are horned demi-giants that are few in number but outsize in stature. Legend has it that the Troggs descend from the Titans who originally kept the four pillars of the world stable before they were slain by the Arken, or at least have some titan blood running through their veins. Adult Troggs typically stand anywhere between six and eight feet tall, and never stop growing throughout their very long lifetimes, sometimes living four or five hundred years and growing to truly enormous stature. All have horns of various size and shapes, and some are born with tails. The Troggs reproduce slowly, have few children, and treasure them greatly. Trogg children spend a long time maturing and only reach adulthood around forty years old."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Like other Kin, Troggs are hugely diverse in their backgrounds and cultures but due to their small number tend to be loners or outsiders to the communities they join. In legends, they are supernaturally tolerant of heat and can handle even molten metal with their bare hands, though how much this holds up in real life varies from Trogg to Trogg. Very traditional Troggs worship the Elden Flame, the primal force of creation, and give themselves over to the study of smithing or the etherial arts. Since Trogg artisans live a long time, they can accumulate several lifetimes of knowledge that Kin from a similar background could accumulate."
            }
        ]
    },
    {
        "id": "kn_beastfolk",
        "type": "Kin",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Beastfolk",
        "image": "https://i.imgur.com/oA0uDJG.png",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The variety of animal-like Kin found across Arden Eld can be broadly called Beastfolk. They are the most common Kin and the most diverse physically. There are many clans of beast folk, including:"
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "list"},
                "content": "",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "subeffect"},
                        "content": "The Lopen ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "are cat or rabbit-like folk originally from the great plains."
                            }
                        ]
                    },
                    {
                        "tags": {"desc_type" : "subeffect"},
                        "content": "The Garou ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "are wolf or dog-like folk from the deep forest and islands."
                            }
                        ]
                    },
                    {
                        "tags": {"desc_type" : "subeffect"},
                        "content": "The Goblins or Vodya ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "are amphibious river-dwelling kin."
                            }
                        ]
                    },
                    {
                        "tags": {"desc_type" : "subeffect"},
                        "content": "The Lorito ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "are feathered, birdlike kin originally hailing from the high steppe."
                            }
                        ]
                    }
                ]
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "There are many other beast folk clans, such as the fishlike Pelagia and reptilian Kuroki from the eastern mountains, and probably still many more that are hidden and spread across the surface of Arden Eld."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Beastfolk tend to be shorter in stature than Thrynn, though some are taller and hardier. They live around the same time as Thrynn and culturally tend have large families. Beast folk are present in every culture, from desert dwelling nomads, to pastoral farmers, to city guilds."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Traditional Beastfolk have a strong connection to the earth and the forest. They are strong woodsfolk, hearty eaters, and excellent hunters. They have better senses than other Kin and are sensitive to the changes in wind, moisture, and earth that signal the weather, the crops, or the changing of the seasons. Their excellent sense of taste and smell lead a lot of beastfolk to become excellent cooks (or picky eaters)."
            }
        ]
    },
    {
        "id": "kn_xixo",
        "type": "Kin",
        "source": "core",
        "tags": {
        },
        "eventtags": {},
        "name": "Xixo",
        "image": "https://i.imgur.com/Lzh151c.png",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "The insectile or crustacean-like Xixo (ZIK-zo) are a group of water-dwelling kin that can traditionally be found as traders up and down the waterways of Arden Eld. Xixo are excellent swimmers and can hold their breath for very long periods of time. They vary widely in physiology, though they are unique in that during spawning season they can change sex, and many Xixo swap around throughout their lives. Though they can have weak eyesight, they are highly sensitive to smell and chemical signals and Xixo can communicate simply emotions or moods to each other through pheromonal markers, leading to the stereotype that they can read each other’s minds."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Though individual Xixo live much shorter lives than other Kin, maturing at around 8 and typically living until their mid 40s, they have perfect memories, able to recall everything in their lives with absolute clarity. A common understanding among the Xixo is that other Kin are terribly cursed - living twice as long as the Xixo, but eventually forgetting a large part of their lives."
            }
        ]
    }
]