[
    {
        "id": "rs_camp",
        "type": "Ruleset",
        "source": "core",
        "tags": { },
        "eventtags": {},
        "name": "Camp",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "Adventurers in Arden Eld often get around on enormous aetherships, traveling wagons, vehicles, or caravans. They bring with them all kinds of supplies: portable shrines, elixir cauldrons, cooking pots, vittles, and lengths of rope for traversing caverns. The camp can be any of these things. It’s representative of the gear, supplies, and transportation that the characters keep in common, and may take with them on an expedition."
            }
        ],
        "rules": [
            {
                "title": "Camp Sheet",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "When you start a group of characters, also start a camp sheet. Camp sheets have the following:"
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "list"},
                        "content": "",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "subeffect"},
                                "content": "Group Name: ",
                                "subcontent": [
                                    {
                                        "tags": {"desc_type" : "desc"},
                                        "content": "You can name your group if you like, or leave it blank until later."
                                    }
                                ]
                            },
                            {
                                "tags": {"desc_type" : "subeffect"},
                                "content": "Ambitions: ",
                                "subcontent": [
                                    {
                                        "tags": {"desc_type" : "desc"},
                                        "content": "Write 1-3 long term goals for your group. If you accomplish an Ambition during an interlude, everyone in your group gets 1 xp, then write a new ambition. You can leave these blank for now if you like."
                                    }
                                ]
                            },
                            {
                                "tags": {"desc_type" : "subeffect"},
                                "content": "Camp Fixtures: ",
                                "subcontent": [
                                    {
                                        "tags": {"desc_type" : "desc"},
                                        "content": "The various pieces of gear, shelter, and accoutrement that your group keeps around camp. Fixtures apply their benefits to everyone in the group and anyone can spend dust to purchase, upgrade, or use them. Start with 1 of your choice."
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "title": "Camping",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "During an expedition you can camp (usually a limited number of times) to clear all strain, regain all effort, and regain all hp. You scarf down a meal, put your feet up, clean your weapons, tend to your wounds, or polish your armor. You then lose all resolve you have accumulated."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Camping is pretty loose and could represent anything from a short break in a battle where you catch your breath or a momentary break on a trail to fix your boots to an entire night or even a few days spent in one place."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "You only camp during an expedition, but you might spend time in your camp (or what your camp represents if it represents something like a caravan or airship) during interludes or in downtime. Either way, the camp is usually a character in its own right and often serves as a home away from home for Icons."
                    }
                ]
            },
            {
                "title": "Camp Fixtures",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "There are various camp fixtures and their upgrades. When you make your characters, start with one. Additional upgrades and fixtures can be bought during an interlude and take effect at the end of an interlude. Anyone can spend dust on them."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "If camp upgrades are nested, you need to take the previous upgrade to get the one under it."
                    }
                ]
            }
        ]
    },
    {
        "id": "rs_trophies",
        "type": "Ruleset",
        "source": "core",
        "tags": { },
        "eventtags": {},
        "name": "Trophies",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "Trophies offer a way for GMs to offer additional minor rewards other than xp or dust. They mostly have effects in tactical combat."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Trophies is a loose term for anything powerful that is scavenged from the dungeons and ruins of Arden Eld, whether it’s an arkentech wonder or something carved from a monster or beast. Trophies are less powerful than Relics, however, having limited use and eventually running out of magical power and crumbling."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "list"},
                "content": "",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "All Trophies grant you either a trait or an ability, and last either a certain number of expeditions or combats, or a certain number of active uses. When uses are depleted to 0, the trophy crumbles or breaks and is no longer usable."
                    },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Characters can hold on to three trophies at once."
                    }
                ]
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "General Dungeon Trophies are listed in the following section and there’s more in each foe section as possible rewards. There will be more in the full game. Every legend (boss) fight in this game has unique trophy rewards."
            }
        ],
        "rules": [
            {
                "title": "Optional: Replenishing trophies",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Trophies are intended to be a ‘one and done’ kind of deal, since they offer a lot of free power to a character. If you want the uses of the trophy to be able to be replenished, or a more permanent part of a character, then make it a long term ambition clock for a character."
                    }
                ]
            }
        ]
    },
    {
        "id": "rs_relics",
        "type": "Ruleset",
        "source": "core",
        "tags": { },
        "eventtags": {},
        "name": "Relics",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "Relics are objects of power that slowly take on aspects of legendary heroes, becoming magical or famous weapons simply by being around you. A relic could be something you retrieved on your adventures or something you have always had that slowly awakens to power."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "Relic colors are thematic and any job can take any color of relic."
            }
        ],
        "rules": [
            {
                "title": "Improving Relics",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Relics start with 1 level and take 6 dust each to unlock levels II and III."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Infuse 1 dust into a relic of your choice when you complete a tactical combat."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Characters gain a relic at level 2, 6, and 9."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Once a Relic is level 3, it can be Aspected by either infusing 12 dust or completing a legendary task. These tasks are suggestions and can be adjusted by the GM to fit your game."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Once at least one character has completed an aspect quest for a relic, other characters can aspect a relic for 4 dust."
                    }
                ]
            },
            {
                "title": "Invoking Relics",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "In combat, some relics have abilities that can be invoked for a powerful effect. Invokes have three types:"
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "effect"},
                        "content": "Attack Invoke: ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "When you make an attack, if the die used for the attack roll is a certain number or higher, you can invoke the relic’s power against your attack target. This only counts the d20, and not the total attack roll. For example, in an (Attack, 15+) invoke, you could invoke the relic’s power when you make any attack roll and the die is 15 or higher. This Invoke happens after the attack roll, but before damage and effects are applied. With attacks that don’t have a roll, such as an auto-hit attack, roll 1d20 anyway to check."
                            }
                        ]
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "effect"},
                        "content": "Gambit Invoke: ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "An invoke that can be triggered under the listed conditions, but only once per combat. For example, an invoke that says ‘gambit: your next attack is a critical hit on hit’ works automatically, but can’t be used again even if that attack misses. Gambits are usually always effects or free actions"
                            }
                        ]
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "effect"},
                        "content": "Round Invoke: ",
                        "subcontent": [
                            {
                                "tags": {"desc_type" : "desc"},
                                "content": "Automatically, at a certain round of combat or later. These effects are always active. For example (Round 5+) relics have effects that are always active at round 5 or later."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "id": "rs_advancement",
        "type": "Ruleset",
        "source": "core",
        "tags": { },
        "eventtags": {},
        "name": "Advancement",
        "description": [
            {
                "tags": {"desc_type" : "desc"},
                "content": "Characters level from level 0 to level 1 after the first session."
            },
            { "tags": {"desc_type" : "gap"}, "content": "" },
            {
                "tags": {"desc_type" : "desc"},
                "content": "At the end of each session, each player checks the xp triggers for their character and gains xp if the trigger was fulfilled."
            },
            {
                "tags": {"desc_type" : "list"},
                "content": "",
                "subcontent": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Did you fulfill at least one of your Ideals? (1 xp) Two or more? (2 xp)"
                    },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Was your character challenged or tested, through combat or otherwise? (1 xp) Multiple times? (2 xp)"
                    },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Accomplished an ambition (group or personal)? (1-3 xp)"
                    },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Invoked Burdens at least once - (1 xp)"
                    }

                ]
            },
            {
                "tags": {"desc_type" : "desc"},
                "content": "When a character hits 15 xp, they clear their xp bar and accumulate a level up, which can be spent at the end of a interlude (a downtime period) or at the end of a session to level up their character. Characters can’t level higher than the chapter the game is currently in."
            }
        ],
        "rules": [
            {
                "title": "Combat Advancement",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "At level 1 and every level afterwards, characters gain +1 Ability Point when they hit 7 xp and go into a camp, enter an interlude, or at the end of a session."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "Ability Points can be spent to gain a new Ability or unlock a Talent for an ability they already have. Only one of an Ability's talents can be unlocked."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "table"},
                        "content": "tb_rule_advancement_combat"
                    }
                ]
            },
            {
                "title": "Narrative Advancement",
                "description": [
                    {
                        "tags": {"desc_type" : "desc"},
                        "content": "At level 0, no character can have an Action Rating higher than 3. From level 1 and onwards characters can only ever have one action at 4 dots."
                    },
                    { "tags": {"desc_type" : "gap"}, "content": "" },
                    {
                        "tags": {"desc_type" : "table"},
                        "content": "tb_rule_advancement_narrative"
                    }
                ]
            }
        ]
    }
]